Validate_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inp="http://dell.com/AddressValidation/Validate/input">
   <soapenv:Header/>
   <soapenv:Body>
      <inp:ValidateRequest>
         <inp:INP_STREET_ADDRESS_1>176 St Unit 103B</inp:INP_STREET_ADDRESS_1>
         <inp:INP_STREET_ADDRESS_2></inp:INP_STREET_ADDRESS_2>
         <inp:INP_CITY>Surrey</inp:INP_CITY>
         <inp:INP_STATE>YT</inp:INP_STATE>
         <inp:INP_POSTAL_CODE>Y8G 1Q3</inp:INP_POSTAL_CODE>
         <inp:INP_COUNTRY_CODE>CA</inp:INP_COUNTRY_CODE>
         <inp:INP_APPLICATION_NAME>TEST</inp:INP_APPLICATION_NAME>
         <inp:INP_IS_RDI_REQUIRED>YES</inp:INP_IS_RDI_REQUIRED>
      </inp:ValidateRequest>
   </soapenv:Body>
</soapenv:Envelope>